app/Filters/BasicauthFilter.php

SELECT *
FROM `api_keys`
WHERE `api_key` = '58e1c289-3db7-42ea-a6f4-7b205e5ede8d'
---
    public function before(RequestInterface $request, $arguments = null)
    {

        //echo "filter";
       //print_r($request); exit();
       // print_r($_SERVER);
        //header('Access-Control-Allow-Origin: *');
        //header('Access-Control-Allow-Origin: *');
         //header("Content-Type:application/json");
       //$rawData=file_get_contents('php://input');
       // $data_json = json_decode(file_get_contents('php://input'), true);
       //  print_r($data_json);
        // exit();


        if(isset($_SERVER['HTTP_X_API_KEY'])) $request_api_key=$_SERVER['HTTP_X_API_KEY'];
        else{
            echo json_encode(array(
                "status" => false,
                "message" => "No API KEY Sent"
            ));
            die;
        }

        $host_name=$_SERVER['HTTP_HOST'];

        $db      = \Config\Database::connect('api_db');
        $builder=$db->table("api_keys");
        $builder->where('api_key', $request_api_key);
       // $builder->where('host_name', $host_name);
        $key_found=$builder->get()->getResult();